{
    "Changes": [
        {
            "LogName": "Loading MayorSpeechStage event",
            "Action": "EditData",
            "Target": "Data/Events/Town",
            "Entries": {
                "{{ModId}}_MayorDebateEvent/H/Hn {{ModId}}_RunningForMayor/!Hn {{ModId}}_VotingDay/n {{ModId}}_MayorDebateMail/": "continue/-1000 -1000/farmer 12 21 2 Lewis 16 21 2 Harvey 13 22 2/changeLocation {{ModId}}_ForestStageArea/addObject 12 21 {{ModId}}_Lecturn 1/addObject 16 21 {{ModId}}_Lecturn 1/temporaryAnimatedSprite Mods\\{{ModId}}\\DebateModeratorTable 0 0 48 48 100 1 1 13 20 false false -1 0 1 0 0 0 hold_last_frame/temporaryAnimatedSprite Mods\\{{ModId}}\\DebateModeratorChair 0 0 16 32 100 1 1 14 21 false false 100 0 1 0 0 0 hold_last_frame/viewport 15 24/pause 1000/--Opening/speak Harvey \"Ladies and Gentleman, welcome to the mayoral debate!\"/emote Harvey 60/speak Harvey \"Let's meet our candidates. We have Mayor Lewis who is a seasoned leader and has been serving as mayor of Pelican Town for many years now.\"/speak Harvey \"Let's also give a big welcome to @ who is a resident of Pelican Town and is challenging Mayor Lewis for the top spot.\"/move Harvey 1 0 0/speak Harvey \"I am now going to pose a series of questions to each candidate with the goal of helping you all to make an informed decision in the upcoming election.\"/--Question1/speak Harvey \"I am going to start with @. You are quite new to politics. How do you plan to navigate the complexities of governing a community like Pelican Town?\"/question null \"My focus will be... \"#\"to work closely with a restored town council to ensure that our decisions reflect the needs of residents.\"#\"on doing what's best for Pelican Town, not just myself.\"/speak Harvey \"Very interesting.\"/--Question2/speak Harvey \"Mayor Lewis. You have been the mayor for many years now.\"/speak Lewis \"That's correct. Ive always done everything I can to serve this town to the best of my abilities.\"/speak Harvey \"What would you say are your primary achievements over these many years?\"/speak Lewis \"Well I would say that I have made numerous contributions to the town's growth and consistently delivered high-quality outcomes. My track record over the years speaks for itself.\"/emote Harvey 40/speak Harvey \"Ok ok.\"/--Question3/speak Harvey \"Lets go back to you @. Can you describe for us what policies you would like to focus on if elected mayor?\"/question null \"I would like to ... \"#\"increase the security of the town.\"#\"increase economic development by attracting new businesses and industries to the area.\"#\"increase community engagement by running new town events and festivals.\"/speak Harvey \"That's a valuable insight to consider.\"/--Question4/speak Harvey \"Mayor Lewis. If you're elected again what would you like to do in your next term?\"/speak Lewis \"There are many initiatives I'd like to explore and implement in my next term. My focus will be on identifying areas where we can streamline processes and improve efficiency. I would like to continue working towards the betterment of Pelican Town.\"/speak Harvey \"Ok great maybe we can hear more details about that in the future.\"/--Question5/speak Harvey \"@, I would like to hear more about your plans for the town and what you'd like to change. If you're elected what do you plan to focus on during your first month?\"/question null \"During my first month,\"#\"My first priority will be to stop monster attacks in the town.\"#\"I will review our budget and identify areas where we can make improvements.\"#\"I'll prioritize meeting with local residents who have been facing challenges in the town.\"/speak Harvey \"Sounds like you'll be busy.\"/--Question6/speak Harvey \"Mayor Lewis. Many feel there has been a lack of transparency in the budget during your administration. There has been some speculation that public funds are being used inappropriately for own private ambitions. What would you say to those people?\"/speak Lewis \"Ehhh well that's ... I'm not aware of any concerns about the use of public funds, but we'll look into it further.\"/speak Harvey \"Is it true there has been a gold statue of you made?\"/emote Lewis 12/speak Lewis \"I don't recall anything about that at the moment ... There may have been some work done for town beautification.\"/speak Harvey \"I see... \"/--Closing/speak Harvey \" Well I would like to thank both of you for taking time out to talk to us today.\"/move Harvey -1 0 2/speak Harvey \"Thank you all for coming to this debate today. I hope this has helped with your decision if the upcoming election.\"/pause 1000/globalFade/viewport 1000 1000/end"
            }
        }
    ]
}