{
    "Changes": [
        {
            "LogName": "AdventureGuild Events Blank",
            "Action": "Load",
            "Target": "Data/Events/AdventureGuild",
            "FromFile": "blank.json"
        },
        {
            "LogName": "Loading NeedMayorSpeech event",
            "Action": "EditData",
            "Target": "Data/Events/AdventureGuild",
            "Entries": {
                "{{ModId}}_NeedMayorEvent/Year 2/!FestivalDay/!Season Winter": "continue/5 13/farmer 6 18 0 marlon 4 11 2 lewis 4 13 0 gil -100 -100 3/changeToTemporaryMap {{ModId}}_AdventureGuild false/addTemporaryActor gil_RockingChair 32 32 11 12 0 false Character gil_rockingchair/animate gil_rockingchair false true 250 0 1 2 3 4/pause 1000/speak marlon \"You really need to take this more seriously. @ has been keeping populations down but these monsters could become a real danger if not monitored properly. We need funding so we can actually pay people to make sure these attacks don't become a real danger to the town.\"/speak lewis \"I don't want to talk about this any more. I've done all I can. I'm leaving now. I have more important things to deal with. Goodbye marlon.\"/move lewis 0 4 1/move farmer 0 -1 3/speak lewis \"Hi @, it's nice to see you. I'm sorry I can't talk right now. I am very busy today.\"/move lewis 0 1 1/move lewis 2 0 1/move lewis 0 2 1/warp lewis 1000 1000/move farmer 0 -2 0/move farmer -2 0 0/move farmer 0 -2 0/emote marlon 12/speak marlon \"There was a monster attack last night. We need more security at night for the town\"/speak gil \"$0The mayor disagrees it seems. We really need someone better to do the job. lewis doesn't actually seem to do anything.\"/emote marlon 12/speak marlon \"He has become far too comfortable in that job. It's coming up to election time again but sadly he ran uncontested last election. Sigh, he beat me so thoroughly when I ran that I don't think I can go through that again \"/emote gil_rockingchair 40/speak gil \"$2Hmm. I'm too old for it but ... what about @\"/animate gil_rockingchair false true 5000 5/warp gil 11 12/move gil -2 0 3/move gil 0 1 2/move gil -3 0 3/speak gil \"$2You have done so much for this town and people seem to really like you.\"/emote gil 8/question fork1 \"Have you ever thought about running for office?#I have and I think I could do a better job.#No I haven't and I'm not interested.\"/fork {{ModId}}_notMayor/speak gil \"That's the spirit!\" /speak marlon \"That's a great idea! I may not have the confidence to run myself any more but I can definitely help you with your campaign. I have the forms around here somewhere for registration. I'll fill them out and post them to the election commission for you.\"/mailReceived {{ModId}}_RegisteredForBallot true/pause 2000/globalFade/viewport -1000 -1000/end"
            }
        },
        {
            "LogName": "Loading NeedMayorSpeech event",
            "Action": "EditData",
            "Target": "Data/Events/Temp",
            "Entries": {
                "{{ModId}}_notMayor": "speak Gil \"That's a pity. Looks like Lewis will run uncontested again.\"/AddConversationTopic {{ModId}}_LastChanceToRegisterForBallotTopic 5/globalFade/viewport -1000 -1000/changeLocation AdventureGuild/end"
            }
        }
    ]
}